help_info = ['help', '[tkg', 'gjvjom', 'хелп', 'помощь', 'рудз', 'помоги']
caesar = ['ceaser', 'wtpfhm', 'цезарь', 'суфыук']
cipher = ['cipher', 'ibah', 'суфзрук', 'шифр', 'шифры', 'шифровка', 'зашифровать']
decipher = ['decipher', 'ltibah', 'вусуфзрук', 'дешифр', 'расшифровка', 'расшифровать']
vigenere = ['vigenere', 'db;tyth', 'мшпутуку', 'виженер']

help_send = '🗿Этот бот создан для незачем, но я все такие познакомлю тебя с его функционалом👀:  \n' \
            'Шифры: \n' \
            '\t Цезарь \n' \
            '\t Виженер' \
            '\n \n' \
            'Чтобы узнать подробнее пиши: \n помощь <инетресуемая команда>'
            
cipher_help = 'Всего бот предоставляеят 2 шифра: \n \n' \
              'Шифр Цезаря("помощь Цезарь" чтобы узнать подробнее) \n' \
              'Шифр Цезаря("помощь Виженер" чтобы узнать подробнее)' \
            
caesar_help = 'Шифр Цезаря🥗,  также известнный как шифр сдвига, код Цезаря или сдвиг Цезаря — ' \
              'один из самых простых🌝 и наиболее широко известных методов шифрования. \n \n' \
              'Шифр Цезаря — это вид шифра подстановки, в котором каждый символ в открытом тексте, заменяется ' \
              'символом, находящимся на некотором постоянном числе позиций левее или правее него в алфавите. \n \n' \
              'Подробнее по ссылке: https://ru.wikipedia.org/wiki/Шифр_Цезаря' \
              '🔎Чтобы зашифровать текст нужно придерживаться формата "цезарь шифр  <ключ> <текст>". \n' \
              '🔎Чтобы дешифровать текст нужно придерживаться формата "цезарь дешифр <ключ> <текст>". \n' \
              '🗣Где ключ - положительное число(❗)'

vigenere_help = 'Шифр Виженера — метод полиалфавитного шифрования буквенного текста с использованием ключевого слова.👁‍🗨' \
                'Этот метод является простой формой многоалфавитной замены. \n' \
                'Подробнее по ссылке: https://ru.wikipedia.org/wiki/Шифр_Виженера' \
                '🔎Чтобы зашифровать текст нужно придерживаться формата "виженер шифр <ключ> <текст>. \n' \
                '🔎Чтобы дешифровать текст нужно придерживаться формата "виженер дешифр <ключ> <текст>. \n' \
                '🗣Где ключ - слово из букв одного алфавита(❗)'

